In [6]:
!pip install mysql-connector

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector in c:\users\gour\appdata\roaming\python\python39\site-packages (2.2.9)

In [2]:
import mysql.connector  #importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "pythonclass8am"
)
db = database.cursor()

In [3]:
db.execute("SELECT * FROM student")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram', 90, 85, 83, 92, 88, 438, 87.6, 'A')]

In [4]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram', 90, 85, 83, 92, 88, 438, 87.6, 'A')]

In [5]:
db.execute("SELECT * FROM student WHERE grade = 'A' and math > 70")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Ram', 90, 85, 83, 92, 88, 438, 87.6, 'A')]

In [6]:
# INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `percentage`, `grade`) VALUES ('4', 'Shyam', '78', '60', '65', '70', '78', '410', '81.4', 'A');
sql = '''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, percentage, grade) 
VALUES ('Shyam', 78, 60, 75, 70, 78, 410, 81.4, 'A')'''
db.execute(sql)
database.commit()

In [7]:
name = input("Enter name = ")
physics = int(input("Enter physics marks = "))
chemistry = int(input("Enter chemistry marks = "))
math = int(input("Enter math marks = "))
english = int(input("Enter english marks = "))
nepali = int(input("Enter nepali marks = "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
    grade = "A"
elif per >=60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    
print("Your Total = ",total)
print("Your Per = ",per)
print("Your Grade = ",grade)

sql = f'''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, percentage, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()
print(sql)

Enter name = Barsha
Enter physics marks = 98
Enter chemistry marks = 65
Enter math marks = 58
Enter english marks = 47
Enter nepali marks = 68
Your Total =  336
Your Per =  67.2
Your Grade =  B
INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, percentage, grade)
VALUES ('Barsha', 98, 65, 58, 47, 68, 336, 67.2, 'B')

In [17]:
sql = f'''DELETE FROM student WHERE sn = 6'''
db.execute(sql)
database.commit()
print(sql)

DELETE FROM student WHERE sn = 6

In [18]:
sql = f'''UPDATE  student SET name = 'Shyama' WHERE sn = 3'''
db.execute(sql)
database.commit()
print(sql)

UPDATE  student SET name = 'Shyama' WHERE sn = 3